[
  "reference_number",
  "location",
  "price_range",
  "restaurant_name",
  "departure_time",
  "restaurant_type",
  "destination",
  "arrival_time",
  "number_of_people",
  "departure_location",
  "area",
  "time",
  "hotel_name",
  "address",
  "date",
  "booking_status",
  "travel_day",
  "cuisine",
  "number_of_nights",
  "restaurant_location",
  "hotel_location",
  "phone_number",
  "restaurant_options",
  "train_date",
  "hotel_type",
  "wifi",
  "reservation_date",
  "train_number",
  "departure_date",
  "arrival_location",
  "cuisine_type",
  "train_departure_time",
  "train_departure_location",
  "number_of_hotels",
  "train_destination",
  "recommendation",
  "postcode",
  "table_size",
  "ticket_quantity",
  "booking_request",
  "accommodation_type",
  "hotel_request",
  "train_id",
  "train_route",
  "suggested_restaurant",
  "departure",
  "train_schedule",
  "price",
  "dining_location",
  "dining_price",
  "stay_duration",
  "train_count",
  "preference",
  "hotel_price",
  "travel_time",
  "train_info",
  "free_parking",
  "departure_day",
  "entrance_fee",
  "booking",
  "options",
  "number_of_places",
  "train_arrival_location",
  "hotel_count",
  "dish",
  "help",
  "area_preference",
  "hotel_price_range",
  "hotel_rating",
  "day",
  "booking_date",
  "train_options",
  "departure_site",
  "travel_date",
  "info_request",
  "further_assistance",
  "town_side",
  "accommodation_name",
  "available_hotels",
  "dining_time",
  "hotel_area",
  "suggested_hotel",
  "start_date",
  "room_type",
  "check_in_date",
  "reservation_time",
  "farewell",
  "total_fee",
  "departure_station",
  "stay_details_request",
  "alternative_time",
  "alternative_date",
  "hotel_internet",
  "museum_recommendation",
  "attraction_type",
  "arrival_day",
  "request_reference",
  "train",
  "guest_house",
  "party_size",
  "trip_location",
  "hotel_options",
  "hotel_stars",
  "attraction_name",
  "museum_count",
  "recommended_place",
  "car_type",
  "guest_count_request",
  "interest_in_attractions",
  "guest_house_price",
  "guest_house_stars",
  "guest_house_wifi",
  "guest_house_location",
  "hotel_choice",
  "taxi_request",
  "museum_address",
  "contact_number",
  "guest_count",
  "intent",
  "train_departure_day",
  "attractions_location",
  "guest_house_parking",
  "booking_details",
  "train_arrival_time",
  "fun_places",
  "train_from",
  "train_to",
  "room_number_of_people",
  "room_nights",
  "room_date",
  "parking",
  "restaurant_address",
  "number_of_tickets",
  "total_price",
  "crossover_locations",
  "restaurant_count",
  "activity_type",
  "departure_time_suggested",
  "narrow_down",
  "spots",
  "restaurant_area",
  "food_preference",
  "start_day",
  "internet",
  "restaurant_reference_number",
  "requested_attraction_type",
  "requested_phone_numbers",
  "final_request",
  "arrive_by",
  "restaurant",
  "number_of_passengers",
  "museum_request",
  "interest",
  "hotel_booking_status",
  "number_of_restaurants",
  "taxi_destination",
  "museum_name",
  "train_price",
  "arrival_station",
  "restaurant_info",
  "nightclub_name",
  "british_restaurants_count",
  "moderate_price_count",
  "expensive_price_count",
  "train_reference",
  "specific_entertainment",
  "hotel_availability",
  "type_of_food",
  "confirmation_code",
  "train_option_1",
  "train_time_1",
  "train_option_2",
  "train_time_2",
  "train_specifications",
  "attractions_count",
  "rating",
  "restaurant_price_range",
  "taxi_arrival_time",
  "hotel_recommendation",
  "gastropub_recommendation",
  "location_preference",
  "restaurant_lookup",
  "accommodation_preference",
  "suggestion",
  "arrival_time_requested",
  "booking_confirmed",
  "price_preference",
  "museum_details_request",
  "museum_interest",
  "gratitude",
  "request_phone_number",
  "museum_phone",
  "train_reference_number",
  "price_matter",
  "restaurant_details_request",
  "number_of_guesthouses",
  "number_of_trains",
  "first_train_time",
  "cost",
  "reserve_table",
  "museum_postcode",
  "museums_count",
  "additional_request",
  "reservation_details",
  "taxi_details",
  "location_centre",
  "location_east",
  "taxi_contact_number",
  "end_conversation",
  "restaurant_price",
  "table_booking",
  "taxi_time",
  "restaurant_booking_time",
  "requested_hotel_rating",
  "booking_size",
  "booking_time",
  "food_type",
  "park_request",
  "museums",
  "book",
  "preferred_area",
  "free_parking_preference",
  "train_time",
  "train_passengers",
  "place_to_eat",
  "hotel_needs",
  "hotel_budget",
  "taxi_status",
  "restaurant_postcode",
  "museum_contact_info",
  "selected_restaurant",
  "alternative_hotel",
  "alternative_hotel_rating",
  "reservation_request",
  "guesthouse_name",
  "guesthouse_location",
  "guesthouse_wifi",
  "guesthouse_price",
  "cuisine_options",
  "sports_attractions",
  "restaurant_found",
  "park_count",
  "entries_found",
  "museum_area",
  "free_wifi",
  "try_another_restaurant",
  "suggested_accommodation",
  "pool_option_1",
  "pool_option_2",
  "vehicle",
  "train_fee",
  "train_departure",
  "train_arrival",
  "confirmation",
  "reservation",
  "restaurant_choice",
  "request_postcode",
  "dining_people",
  "taxi_booking",
  "ticket_price",
  "wifi_request",
  "area_preference_confirmed",
  "area_of_town",
  "nearest_police_station",
  "restaurant_phone",
  "payment_method",
  "restaurant_phone_number",
  "colleges_count",
  "user_needs",
  "guesthouse_address",
  "attraction_location",
  "attraction_phone",
  "restaurant_cuisine",
  "college_suggestion",
  "wifi_status",
  "final_confirmation",
  "recommended_park",
  "park_details",
  "needs_met",
  "recommended_college",
  "entry_fee",
  "still_want_italian",
  "star_rating",
  "wifi_availability",
  "pool_phone",
  "pool_address",
  "driver_contact",
  "hotel_parking",
  "recommended_restaurant",
  "hotel_preferences",
  "booking_reference",
  "request_booking",
  "requested_taxi_type",
  "taxi_booking_request",
  "college_preference",
  "preferred_food_type",
  "hotel_info_request",
  "park_address_requested",
  "best_restaurant",
  "book_best_restaurant",
  "train_booking_status",
  "telephone_number",
  "hotel_check_in_date",
  "hotel_guests",
  "hotel_nights",
  "restaurant_booking_status",
  "acknowledgment",
  "museum_phone_number",
  "confirmed_taxi_type",
  "college_name",
  "college_phone_number",
  "request_address",
  "hotel_phone",
  "hotel_address",
  "park_address",
  "total_cost",
  "payment_reference_number",
  "table_hold_time",
  "taxi_booking_status",
  "driver_contact_policy",
  "guesthouses_count",
  "hotel_reference_number",
  "request_assistance",
  "user_feedback",
  "final_acknowledgment",
  "completion",
  "goodbye",
  "museum_area_info",
  "farewell_message",
  "college_interest",
  "thank_you",
  "booking_confirmation",
  "appreciation",
  "ref_number"
]